In [12]:
!pip install mysqlclient

Requirement already satisfied: mysqlclient in c:\users\h\desktop\my_sql\venv\lib\site-packages (2.1.1)

In [13]:
import MySQLdb as sqldb

In [16]:
import pandas as pd
import numpy as np

ModuleNotFoundError: No module named 'pandas'

In [17]:
db = sqldb.connect(host='localhost', port=3306, user='root', passwd='1234', charset='utf8')

In [18]:
cursor = db.cursor()

In [19]:
sql = 'show databases;'

cursor.execute(sql)
cursor.fetchall()

(('information_schema',),
 ('employees',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('shopdb',),
 ('sqldb',),
 ('sys',),
 ('testdb',),
 ('world',))

In [20]:
sql = """
drop database if exists testdb;
create database testdb;
"""

cursor.execute(sql)

0

In [21]:
sql = 'show databases;'

cursor.execute(sql)

10

In [22]:
cursor.fetchall()

(('information_schema',),
 ('employees',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('shopdb',),
 ('sqldb',),
 ('sys',),
 ('testdb',),
 ('world',))

In [23]:
sql = 'use testdb;'
cursor.execute(sql)

0

In [24]:
sql = """
create table my table(
    no int not null auto_increment
    name char(20) not null,
    age tinyint,
    phone varchar(20),
    email varchar(30) not null, 
    address varchar(50),
    primary key(no)
)
"""

#cursor.execute(sql)

In [25]:
sql = 'show tables;'
cursor.execute(sql)

0

In [26]:
cursor.fetchall()

()

In [27]:
sql = 'use sakila'
cursor.execute(sql)

0

In [28]:
df = pd.read_sql('select * from customer', db)
df.head()

NameError: name 'pd' is not defined

In [84]:
df.to_csv('cust.csv')

In [87]:
df_table = pd.read_sql('show tables;',db)

C:\Users\h\AppData\Local\Temp\ipykernel_16748\3283205452.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_table = pd.read_sql('show tables;',db)

In [92]:
def save_to_csv(table_name):
    table_df = pd.read_sql('select * from {}'.format(table_name), db)
    table_df.to_csv('{}.csv'.format(table_name))

In [94]:
save_to_csv('film')

C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)

In [97]:
df_table['Tables_in_sakila'].apply(save_to_csv)

C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)
C:\Users\h\AppData\Local\Temp\ipykernel_16748\1465791357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  table_df = pd.read_sql('select * from {}'.format(table_name), db)

0     None
1     None
2     None
3     None
4     None
5     None
6     None
7     None
8     None
9     None
10    None
11    None
12    None
13    None
14    None
15    None
16    None
17    None
18    None
19    None
20    None
21    None
22    None
Name: Tables_in_sakila, dtype: object

In [99]:
df_temp = pd.read_csv('sakila_tables/city.csv')
df_temp.head()

   Unnamed: 0  city_id                city  country_id          last_update
0           0        1  A Corua (La Corua)          87  2006-02-15 04:45:25
1           1        2                Abha          82  2006-02-15 04:45:25
2           2        3           Abu Dhabi         101  2006-02-15 04:45:25
3           3        4                Acua          60  2006-02-15 04:45:25
4           4        5               Adana          97  2006-02-15 04:45:25

In [101]:
df_temp['last_update'].apply(lambda x : x.split('-')[0])

0      2006
1      2006
2      2006
3      2006
4      2006
       ...
595    2006
596    2006
597    2006
598    2006
599    2006
Name: last_update, Length: 600, dtype: object

In [103]:
sql = 'show databases;'

cursor.execute(sql)
cursor.fetchall()

(('information_schema',),
 ('employees',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('shopdb',),
 ('sqldb',),
 ('sys',),
 ('testdb',),
 ('world',))

In [104]:
sql = 'use world;'
cursor.execute(sql)

0

In [106]:
pd.read_sql('show tables;', db)

C:\Users\h\AppData\Local\Temp\ipykernel_16748\1930542043.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql('show tables;', db)

   Tables_in_world
0             city
1          country
2  countrylanguage

In [109]:
pd.read_sql('select * from country;', db)

C:\Users\h\AppData\Local\Temp\ipykernel_16748\4062617895.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql('select * from country;', db)

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129.0,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648.0,7984.0,Angola,Republic,JosÃ© Eduardo dos Santos,56.0,AO
3,AIA,Anguilla,North America,Caribbean,96.0,NaN,8000,76.1,63.2,NaN,Anguilla,Dependent Territory of the UK,Elisabeth II,62.0,AI
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,ShqipÃ«ria,Republic,Rexhep Mejdani,34.0,AL
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
234,YEM,Yemen,Asia,Middle East,527968.0,1918.0,18112000,59.8,6041.0,5729.0,Al-Yaman,Republic,Ali Abdallah Salih,1780.0,YE
235,YUG,Yugoslavia,Europe,Southern Europe,102173.0,1918.0,10640000,72.4,17000.0,NaN,Jugoslavija,Federal Republic,Vojislav KoÂštunica,1792.0,YU
236,ZAF,South Africa,Africa,Southern Africa,1221037.0,1910.0,40377000,51.1,116729.0,129092.0,South Africa,Republic,Thabo Mbeki,716.0,ZA
237,ZMB,Zambia,Africa,Eastern Africa,752618.0,1964.0,9169000,37.2,3377.0,3922.0,Zambia,Republic,Frederick Chiluba,3162.0,ZM
238,ZWE,Zimbabwe,Africa,Eastern Africa,390757.0,1980.0,11669000,37.8,5951.0,8670.0,Zimbabwe,Republic,Robert G. Mugabe,4068.0,ZW

In [134]:
# 수명이 가장 긴 상위 5개 국가를 출력
pd.read_sql('select * from country order by LifeExpectancy desc limit 5;', db)

C:\Users\h\AppData\Local\Temp\ipykernel_16748\1337216161.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql('select * from country order by LifeExpectancy desc limit 5;', db)

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,AND,Andorra,Europe,Southern Europe,468.0,1278.0,78000,83.5,1630.0,NaN,Andorra,Parliamentary Coprincipality,,55,AD
1,MAC,Macao,Asia,Eastern Asia,18.0,NaN,473000,81.6,5749.0,5940.0,Macau/Aomen,Special Administrative Region of China,Jiang Zemin,2454,MO
2,SMR,San Marino,Europe,Southern Europe,61.0,885.0,27000,81.1,510.0,NaN,San Marino,Republic,None,3171,SM
3,JPN,Japan,Asia,Eastern Asia,377829.0,-660.0,126714000,80.7,3787042.0,4192638.0,Nihon/Nippon,Constitutional Monarchy,Akihito,1532,JP
4,SGP,Singapore,Asia,Southeast Asia,618.0,1965.0,3567000,80.1,86503.0,96318.0,Singapore/Singapura/Xinjiapo/Singapur,Republic,Sellapan Rama Nathan,3208,SG

In [123]:
df = pd.read_sql('select * from country;', db)
df.sort_values('LifeExpectancy', ascending=False).head()

C:\Users\h\AppData\Local\Temp\ipykernel_16748\3543251089.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('select * from country;', db)

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
5,AND,Andorra,Europe,Southern Europe,468.0,1278.0,78000,83.5,1630.0,NaN,Andorra,Parliamentary Coprincipality,,55.0,AD
129,MAC,Macao,Asia,Eastern Asia,18.0,NaN,473000,81.6,5749.0,5940.0,Macau/Aomen,Special Administrative Region of China,Jiang Zemin,2454.0,MO
193,SMR,San Marino,Europe,Southern Europe,61.0,885.0,27000,81.1,510.0,NaN,San Marino,Republic,None,3171.0,SM
109,JPN,Japan,Asia,Eastern Asia,377829.0,-660.0,126714000,80.7,3787042.0,4192638.0,Nihon/Nippon,Constitutional Monarchy,Akihito,1532.0,JP
186,SGP,Singapore,Asia,Southeast Asia,618.0,1965.0,3567000,80.1,86503.0,96318.0,Singapore/Singapura/Xinjiapo/Singapur,Republic,Sellapan Rama Nathan,3208.0,SG

In [124]:
# 인구수 5000만 이상이면서 gnp가 20000 이상인 국가를 출력

In [127]:
pd.read_sql('select * from country where Population>50000000 and gnp/population> 0.02 ;', db)

C:\Users\h\AppData\Local\Temp\ipykernel_16748\2311250186.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql('select * from country where Population>50000000 and gnp/population> 0.02 ;', db)

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,DEU,Germany,Europe,Western Europe,357022.0,1955,82164700,77.4,2133367.0,2102826.0,Deutschland,Federal Republic,Johannes Rau,3068,DE
1,FRA,France,Europe,Western Europe,551500.0,843,59225700,78.8,1424285.0,1392448.0,France,Republic,Jacques Chirac,2974,FR
2,GBR,United Kingdom,Europe,British Islands,242900.0,1066,59623400,77.7,1378330.0,1296830.0,United Kingdom,Constitutional Monarchy,Elisabeth II,456,GB
3,ITA,Italy,Europe,Southern Europe,301316.0,1861,57680000,79.0,1161755.0,1145372.0,Italia,Republic,Carlo Azeglio Ciampi,1464,IT
4,JPN,Japan,Asia,Eastern Asia,377829.0,-660,126714000,80.7,3787042.0,4192638.0,Nihon/Nippon,Constitutional Monarchy,Akihito,1532,JP
5,USA,United States,North America,North America,9363520.0,1776,278357000,77.1,8510700.0,8110900.0,United States,Federal Republic,George W. Bush,3813,US

In [131]:
# sakila db에서 월별 렌탈 횟수가 30회 이상인 유저의 이름과 이메일을 출력

# 매출이 가장 많은 영화 제목
# film, inventory, rental

In [139]:
sql = 'use sakila'
cursor.execute(sql)

0

In [142]:
sql = """
select 
    f.film_id, f.title, sum(p.amount)
from
    film f, rental r, inventory i, payment p
where
    i.film_id = f.film_id
    and i.inventory_id = r.inventory_id
    and p.rental_id = r.rental_id
group by f.film_id;
"""

df_join = pd.read_sql(sql,db).head()
df_join.head()

C:\Users\h\AppData\Local\Temp\ipykernel_16748\1518790698.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_join = pd.read_sql(sql,db).head()

   film_id             title  sum(p.amount)
0        1  ACADEMY DINOSAUR          36.77
1        2    ACE GOLDFINGER          52.93
2        3  ADAPTATION HOLES          37.88
3        4  AFFAIR PREJUDICE          91.77
4        5       AFRICAN EGG          51.88